Documents/УдалитьРассылка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УдалитьРассылка</Name>
			<Comment>Трейд Софт</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СостоянияПоАвтоинформированию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийДляСкоринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстаДляАвтоинформирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНаВыполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиSMS4B</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеДанныеЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВариантыДействийДляСкоринга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыДействийДляСкоринга</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизвольноеДействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMSОповещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГолосовоеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EMailРассылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускБП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеБП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УдалитьРассылка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДействиеПриИзменении(Неопределено);
	//ВидКИПриИзменении(Неопределено);
	//ШаблонПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
//	Элементы.ОбъектыДействие.Видимость = Объект.Действие.Пустая();
	Если Объект.Действие = ПредопределенноеЗначение("Перечисление.ВариантыДействийДляСкоринга.SMSОповещение") Тогда
		Элементы.УчетнаяЗаписьОтправителя.Доступность = Истина;
		Элементы.УчетнаяЗаписьОтправителя.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.УчетныеЗаписиSMS4B");
	ИначеЕсли Объект.Действие = ПредопределенноеЗначение("Перечисление.ВариантыДействийДляСкоринга.EMailРассылка") Тогда
		Элементы.УчетнаяЗаписьОтправителя.Доступность = Истина;
		Элементы.УчетнаяЗаписьОтправителя.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты");
	ИначеЕсли Объект.Действие = ПредопределенноеЗначение("Перечисление.ВариантыДействийДляСкоринга.ПустаяСсылка") Тогда
		Объект.УчетнаяЗаписьОтправителя = ПредопределенноеЗначение("Справочник.УчетныеЗаписиSMS4B.ПустаяСсылка");
		Элементы.УчетнаяЗаписьОтправителя.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидКИПриИзменении(Элемент)
	ИзменитьВидКИ();
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидКИ()
	Для Каждого Элемент ИЗ Объект.Объекты Цикл
		Элемент.Контакт = Автоинформирование.ПолучитьКонтакт(Элемент.Объект, Объект.ВидКИ);		 
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ИзменитьШаблон()
	Для Каждого Элемент ИЗ Объект.Объекты Цикл
		Элемент.Текст = Автоинформирование.ПолучитьПодсказку(Элемент.Объект, Объект.Шаблон);		 
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	ИзменитьШаблон();
КонецПроцедуры

&НаСервере
Процедура ПодборВтаблЧасть(Результат)
	Об = РеквизитФормыВЗначение("Объект");		
	РаботаСДокументами.ЗанестиРезультатПодбораВТабличнуюЧасть(Об.Объекты, Результат);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектыОбъект);
	
	//
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПриИзменении(Элемент)
	//Если Не Элемент.ТекущиеДанные = Неопределено И Не Элемент.ТекущиеДанные.Объект = Неопределено Тогда
	//	Элемент.ТекущиеДанные.Контакт = ПолучитьКонтактСервер(Элемент.ТекущиеДанные.Объект, Объект.ВидКИ);
	//	Элемент.ТекущиеДанные.Текст = ПолучитьПодсказкуСервер(Элемент.ТекущиеДанные.Объект, Объект.Шаблон);
	//КонецЕсли;
КонецПроцедуры

&НаСервере 
Функция ПолучитьКонтактСервер(ДО, ВидКИ)
	Возврат Автоинформирование.ПолучитьКонтакт(ДО, ВидКИ);
КонецФункции

&НаСервере 
Функция ПолучитьПодсказкуСервер(ДО, ВидКИ)
	Возврат Автоинформирование.ПолучитьПодсказку(ДО, ВидКИ);
КонецФункции


&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	Для Каждого Элемент ИЗ Объект.Объекты Цикл
		Элемент.Контакт = ПолучитьКонтактСервер(Элемент.Объект, Объект.ВидКИ);
		Элемент.Текст = ПолучитьПодсказкуСервер(Элемент.Объект, Объект.Шаблон);		 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры
